app/views/users/show.html.erb

SELECT  1 AS one FROM "invitations" WHERE "invitations"."invited_id" = $1 AND "invitations"."accepted" = $2 AND "invitations"."rejected" = $3 LIMIT $4  [["invited_id", 1], ["accepted", false], ["rejected", false], ["LIMIT", 1]]
---

<% if !Invitation.where(invited_id: @user.id, accepted: false, rejected: false).empty? %>

SELECT  1 AS one FROM "invitations" WHERE "invitations"."invited_id" = $1 AND "invitations"."accepted" = $2 LIMIT $3  [["invited_id", 1], ["accepted", true], ["LIMIT", 1]]
---

<% if !Invitation.where(invited_id: @user.id, accepted: true).empty? %>

SELECT  1 AS one FROM "invitations" WHERE "invitations"."invited_id" = $1 AND "invitations"."rejected" = $2 LIMIT $3  [["invited_id", 1], ["rejected", true], ["LIMIT", 1]]
---

<% if !Invitation.where(invited_id: @user.id, rejected: true).empty? %>

SELECT  1 AS one FROM "invitations" WHERE "invitations"."inviter_id" = $1 LIMIT $2  [["inviter_id", 1], ["LIMIT", 1]]
---

<% if !Invitation.where(inviter_id: @user.id).empty? %>