app/views/shared/_show_invitations.html.erb

        <% if title == "Sended" %>
            <% user = User.find(invitation.invited_id) %>
        <% else %>
            <% user = User.find(invitation.inviter_id) %>
        <% end %>
        <% event = Event.find(invitation.event_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

        <span style=<%= color %>><li>
            <p>User name: <%= user.name %> - Email: <%= user.email %> | <%= Event.find(invitation.event_id).name %></p>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

            <p>Sended invitations: <b>(<%= user.invitings.count %>)</b> |
                         Accepted: (<%= Invitation.where(inviter_id: user.id, accepted: true).count %>) -
                         Rejected: (<%= Invitation.where(inviter_id: user.id, rejected: true).count %>)</p>
            <p>Received invitations: <b>(<%= user.inviters.count %>)</b> |
                           Accepted: (<%= Invitation.where(invited_id: user.id, accepted: true).count %>) -
                           Rejected: (<%= Invitation.where(invited_id: user.id, rejected: true).count %>)</p>
            <% if title == "Received" && current_user == User.find(params[:id]) %>
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."inviter_id" = $1 ORDER BY "invitations"."created_at" DESC  [["inviter_id", 2]]
SELECT COUNT(*) FROM "invitations" WHERE "invitations"."inviter_id" = $1 AND "invitations"."accepted" = $2  [["inviter_id", 1], ["accepted", true]]
SELECT COUNT(*) FROM "invitations" WHERE "invitations"."inviter_id" = $1 AND "invitations"."rejected" = $2  [["inviter_id", 1], ["rejected", true]]
SELECT "invitations".* FROM "invitations" WHERE "invitations"."invited_id" = $1 AND "invitations"."accepted" = $2 ORDER BY "invitations"."created_at" DESC  [["invited_id", 1], ["accepted", true]]
SELECT COUNT(*) FROM "invitations" WHERE "invitations"."invited_id" = $1 AND "invitations"."accepted" = $2  [["invited_id", 1], ["accepted", true]]
SELECT COUNT(*) FROM "invitations" WHERE "invitations"."invited_id" = $1 AND "invitations"."rejected" = $2  [["invited_id", 1], ["rejected", true]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

            <% action_name_i = title == "Sended" ? "sended as" : "received by" %>
            <% if Event.find(invitation.event_id).creator.id == invitation.inviter_id  %>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]