app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "event_type", "event_start_at", "event_end_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    if @event.save

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
---
  def destroy
    if @event.destroy

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "admin"], ["LIMIT", 1]]
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."inviter_id" = $1 AND "invitations"."invited_id" = $2 AND "invitations"."event_id" = $3 LIMIT $4  [["inviter_id", 2], ["invited_id", 1], ["event_id", 7], ["LIMIT", 1]]
INSERT INTO "invitations" ("inviter_id", "invited_id", "created_at", "updated_at", "event_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["inviter_id", 2], ["invited_id", 1], ["created_at", "2020-03-12 16:05:08.364352"], ["updated_at", "2020-03-12 16:05:08.364352"], ["event_id", 7]]
---
  def handle_forms
    if !params[:attend].nil?
      redirect_back(fallback_location: root_path) unless !@event.attendees.include?(current_user)
      @event.attendees << current_user
    elsif !params[:cancel].nil?
      @event.attendees.delete(current_user)
    elsif !params[:invite].nil?
      redirect_back(fallback_location: root_path) if current_user.name == params[:invite][:user_name]
      invited = User.find_by(name: params[:invite][:user_name])
      redirect_back(fallback_location: root_path) unless
                         Invitation.find_by(inviter_id: current_user.id,
                                            invited_id: invited.id, event_id: @event.id).nil?
      new_invitation = Invitation.new(inviter_id: current_user.id, invited_id: invited.id,
                                                                    event_id: @event.id)
      if new_invitation.save