app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(email: params[:sessions][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@mail.com"], ["LIMIT", 1]]