app/controllers/users_controller.rb

SELECT  "invitations".* FROM "invitations" WHERE "invitations"."inviter_id" = $1 AND "invitations"."invited_id" = $2 AND "invitations"."event_id" = $3 LIMIT $4  [["inviter_id", 2], ["invited_id", 1], ["event_id", 7], ["LIMIT", 1]]
UPDATE "invitations" SET "accepted" = $1, "updated_at" = $2 WHERE "invitations"."id" = $3  [["accepted", true], ["updated_at", "2020-03-12 16:11:24.861328"], ["id", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def handle_forms
    if !params[:accept_form].nil?
      inv = Invitation.find_by(inviter_id: params[:accept_form][:inviter_id],
        invited_id: current_user.id,
          event_id: params[:accept_form][:event_id])
      redirect_back(fallback_location: root_path) if inv.accepted? || inv.rejected?
      inv.update_attribute(:accepted, true)
      if inv.save
        Event.find(inv.event_id).attendees << current_user